# Analisis previo

Explorando los datos del conjunto BlackFriday.csv

In [4]:
# importando librerias necesarias
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

In [5]:
df = pd.read_csv('datasets/BlackFriday.csv', sep=',')
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [6]:
df.shape

(537577, 12)

In [7]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [11]:
df.groupby(['City_Category']).agg(['mean', 'count'])

                    User_ID         Occupation         Marital_Status          \
                       mean   count       mean   count           mean   count
City_Category
A              1.002901e+06  144638   7.857306  144638       0.381988  144638
B              1.003033e+06  226493   7.973244  226493       0.407430  226493
C              1.003015e+06  166446   8.427538  166446       0.433955  166446

              Product_Category_1         Product_Category_2          \
                            mean   count               mean   count
City_Category
A                       5.437036  144638           9.945026   96755
B                       5.300420  226493           9.825763  155248
C                       5.165964  166446           9.779649  118588

              Product_Category_3            Purchase
                            mean  count         mean   count
City_Category
A                      12.682530  40848  8958.011014  144638
B                      12.674811  68185  9198.657848  226493
C                      12.654322  55245  9844.441855  166446

In [10]:
df.groupby(['Stay_In_Current_City_Years']).agg(['count'])

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
,count,count,count,count,count,count,count,count,count,count,count
Stay_In_Current_City_Years,,,,,,,,,,,
0,72725,72725,72725,72725,72725,72725,72725,72725,49698,22061,72725
1,189192,189192,189192,189192,189192,189192,189192,189192,130139,57297,189192
2,99459,99459,99459,99459,99459,99459,99459,99459,69184,31040,99459
3,93312,93312,93312,93312,93312,93312,93312,93312,64705,28886,93312
4+,82889,82889,82889,82889,82889,82889,82889,82889,56865,24994,82889

In [8]:
df.groupby(['Occupation']).agg(['count'])

,User_ID,Product_ID,Gender,Age,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
,count,count,count,count,count,count,count,count,count,count,count
Occupation,,,,,,,,,,,
0,68120,68120,68120,68120,68120,68120,68120,68120,46658,20677,68120
1,45971,45971,45971,45971,45971,45971,45971,45971,30959,13209,45971
2,25845,25845,25845,25845,25845,25845,25845,25845,17320,7391,25845
3,17366,17366,17366,17366,17366,17366,17366,17366,11795,4973,17366
4,70862,70862,70862,70862,70862,70862,70862,70862,49231,22076,70862
5,11985,11985,11985,11985,11985,11985,11985,11985,8328,3840,11985
6,19822,19822,19822,19822,19822,19822,19822,19822,13300,5706,19822
7,57806,57806,57806,57806,57806,57806,57806,57806,39747,17542,57806
8,1524,1524,1524,1524,1524,1524,1524,1524,1117,539,1524
9,6153,6153,6153,6153,6153,6153,6153,6153,4401,1842,6153
10,12623,12623,12623,12623,12623,12623,12623,12623,9107,4268,12623
11,11338,11338,11338,11338,11338,11338,11338,11338,7548,3234,11338
12,30423,30423,30423,30423,30423,30423,30423,30423,21891,10304,30423
13,7548,7548,7548,7548,7548,7548,7548,7548,4951,2025,7548
14,26712,26712,26712,26712,26712,26712,26712,26712,18713,8258,26712
15,11812,11812,11812,11812,11812,11812,11812,11812,8358,3911,11812
16,24790,24790,24790,24790,24790,24790,24790,24790,16930,7194,24790
17,39090,39090,39090,39090,39090,39090,39090,39090,28439,13844,39090
18,6525,6525,6525,6525,6525,6525,6525,6525,4399,1968,6525
19,8352,8352,8352,8352,8352,8352,8352,8352,5680,2397,8352
20,32910,32910,32910,32910,32910,32910,32910,32910,21719,9080,32910

In [37]:
# calcular el numero de nulos

df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [40]:
# vamos a eliminar las variables con valores nulos
# actualizamos el df eliminando la columna product category 3 y 
df = df.drop(["Product_Category_2"], axis=1)
df = df.drop(["Product_Category_3"], axis=1)

In [41]:
df.describe

<bound method NDFrame.describe of         User_ID Product_ID Gender    Age  Occupation City_Category  \
0       1000001  P00069042      F   0-17          10             A
1       1000001  P00248942      F   0-17          10             A
2       1000001  P00087842      F   0-17          10             A
3       1000001  P00085442      F   0-17          10             A
4       1000002  P00285442      M    55+          16             C
5       1000003  P00193542      M  26-35          15             A
6       1000004  P00184942      M  46-50           7             B
7       1000004  P00346142      M  46-50           7             B
8       1000004   P0097242      M  46-50           7             B
9       1000005  P00274942      M  26-35          20             A
10      1000005  P00251242      M  26-35          20             A
11      1000005  P00014542      M  26-35          20             A
12      1000005  P00031342      M  26-35          20             A
13      1000005  P00145042      M  26-35          20             A
14      1000006  P00231342      F  51-55           9             A
15      1000006  P00190242      F  51-55           9             A
16      1000006   P0096642      F  51-55           9             A
17      1000006  P00058442      F  51-55           9             A
18      1000007  P00036842      M  36-45           1             B
19      1000008  P00249542      M  26-35          12             C
20      1000008  P00220442      M  26-35          12             C
21      1000008  P00156442      M  26-35          12             C
22      1000008  P00213742      M  26-35          12             C
23      1000008  P00214442      M  26-35          12             C
24      1000008  P00303442      M  26-35          12             C
25      1000009  P00135742      M  26-35          17             C
26      1000009  P00039942      M  26-35          17             C
27      1000009  P00161442      M  26-35          17             C
28      1000009  P00078742      M  26-35          17             C
29      1000010  P00085942      F  36-45           1             B
...         ...        ...    ...    ...         ...           ...
537547  1004733  P00244042      M  18-25          18             C
537548  1004734  P00111042      M  51-55           1             B
537549  1004734  P00345842      M  51-55           1             B
537550  1004735  P00278242      M  46-50           3             C
537551  1004735  P00313442      M  46-50           3             C
537552  1004735   P0098642      M  46-50           3             C
537553  1004735  P00119342      M  46-50           3             C
537554  1004735  P00114042      M  46-50           3             C
537555  1004735  P00135142      M  46-50           3             C
537556  1004736  P00194542      M  18-25          20             A
537557  1004736  P00175242      M  18-25          20             A
537558  1004736  P00101942      M  18-25          20             A
537559  1004736  P00109142      M  18-25          20             A
537560  1004736  P00084842      M  18-25          20             A
537561  1004736  P00078142      M  18-25          20             A
537562  1004736  P00146742      M  18-25          20             A
537563  1004736  P00154642      M  18-25          20             A
537564  1004736  P00117442      M  18-25          20             A
537565  1004736  P00051142      M  18-25          20             A
537566  1004736  P00048742      M  18-25          20             A
537567  1004736  P00157542      M  18-25          20             A
537568  1004736  P00250642      M  18-25          20             A
537569  1004736  P00023142      M  18-25          20             A
537570  1004736  P00162442      M  18-25          20             A
537571  1004737  P00221442      M  36-45          16             C
537572  1004737  P00193542      M  36-45          16             C
537573  1004737  P00111142      M  36-45          16             C
537574  1004737  P00345942      M  36-45          16             C
537575  1004737  P00285842      M  36-45          16             C
537576  1004737  P00118242      M  36-45          16             C

       Stay_In_Current_City_Years  Marital_Status  Product_Category_1  \
0                               2               0                   3
1                               2               0                   1
2                               2               0                  12
3                               2               0                  12
4                              4+               0                   8
5                               3               0                   1
6                               2               1                   1
7                               2               1                   1
8                               2               1                   1
9                               1               1                   8
10                              1               1                   5
11                              1               1                   8
12                              1               1                   8
13                              1               1                   1
14                              1               0                   5
15                              1               0                   4
16                              1               0                   2
17                              1               0                   5
18                              1               1                   1
19                             4+               1                   1
20                             4+               1                   5
21                             4+               1                   8
22                             4+               1                   8
23                             4+               1                   8
24                             4+               1                   1
25                              0               0                   6
26                              0               0                   8
27                              0               0                   5
28                              0               0                   5
29                             4+               1                   2
...                           ...             ...                 ...
537547                          1               0                   1
537548                          1               1                  15
537549                          1               1                   2
537550                          3               0                   1
537551                          3               0                   5
537552                          3               0                   6
537553                          3               0                  10
537554                          3               0                   5
537555                          3               0                  13
537556                          1               1                   8
537557                          1               1                   2
537558                          1               1                   8
537559                          1               1                   8
537560                          1               1                   8
537561                          1               1                   8
537562                          1               1                   1
537563                          1               1                   8
537564                          1               1                   5
537565                          1               1                   8
537566                          1               1                   5
537567                          1               1                   8
537568                          1               1                  11
537569                          1               1                   5
537570                          1               1                   1
537571                          1               0                   1
537572                          1               0                   1
537573                          1               0                   1
537574                          1               0                   8
537575                          1               0                   5
537576                          1               0                   5

        Purchase
0           8370
1          15200
2           1422
3           1057
4           7969
5          15227
6          19215
7          15854
8          15686
9           7871
10          5254
11          3957
12          6073
13         15665
14          5378
15          2079
16         13055
17          8851
18         11788
19         19614
20          8584
21          9872
22          9743
23          5982
24         11927
25         16662
26          5887
27          6973
28          5391
29         16352
...          ...
537547     11543
537548     20924
537549     13082
537550     11658
537551      6863
537552     16415
537553     18526
537554      7099
537555       578
537556      2183
537557     12724
537558      7796
537559      7770
537560      5940
537561      7834
537562     11508
537563      6074
537564      7084
537565      7934
537566      5350
537567      1994
537568      5930
537569      7042
537570     15491
537571     11852
537572     11664
537573     19196
537574      8043
537575      7172
537576      6875

[537577 rows x 10 columns]>

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 10 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Purchase                      537577 non-null int64
dtypes: int64(5), object(5)
memory usage: 41.0+ MB

In [43]:
# suma del numero de productos vendidos agrupados por producto
df.groupby(['Product_ID']).agg(['mean', 'count']).head()

                 User_ID       Occupation       Marital_Status        \
                    mean count       mean count           mean count
Product_ID
P00000142   1.003035e+06  1130   7.972566  1130       0.375221  1130
P00000242   1.003055e+06   371   7.582210   371       0.369272   371
P00000342   1.002701e+06   238   7.869748   238       0.399160   238
P00000442   1.003093e+06    92   6.847826    92       0.413043    92
P00000542   1.003250e+06   146   7.239726   146       0.308219   146

           Product_Category_1            Purchase
                         mean count          mean count
Product_ID
P00000142                   3  1130  11143.507080  1130
P00000242                   2   371  10552.293801   371
P00000342                   5   238   5299.928571   238
P00000442                   5    92   4795.358696    92
P00000542                   5   146   5419.308219   146

In [47]:
# vamos a normalizar los datos

gender_dict = {'F':0, 'M':1}
age_dict = {'0-17':0, '18-25':1, '26-35':2, '36-45':3, '46-50':4, '51-55':5, '55+':6}
city_dict = {'A':0, 'B':1, 'C':2}
stay_dict = {'0':0, '1':1, '2':2, '3':3, '4+':4}

In [48]:
df["Gender"] = df["Gender"].apply(lambda x: gender_dict[x])

df["Age"] = df["Age"].apply(lambda x: age_dict[x])

df["City_Category"] = df["City_Category"].apply(lambda x: city_dict[x])

df["Stay_In_Current_City_Years"] = df["Stay_In_Current_City_Years"].apply(lambda x: stay_dict[x])

In [49]:
df.sample(9)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase
275002,1000380,P00365242,1,2,2,2,1,0,5,8618
11298,1001702,P00078842,1,1,10,2,2,0,1,15317
63084,1003693,P00111942,1,2,15,1,1,1,8,7942
513766,1001163,P00070042,1,0,10,2,2,0,1,15583
329812,1002850,P00057742,1,1,20,1,4,0,2,6635
119546,1000452,P00036842,1,5,17,0,3,1,1,15688
361255,1001628,P00148642,1,1,20,1,1,0,6,20115
213364,1002967,P00030642,1,2,0,0,1,0,8,6131
212342,1002809,P00237542,1,2,7,0,4,0,1,15619

In [50]:
df['Marital_Status'].value_counts()

0    317817
1    219760
Name: Marital_Status, dtype: int64

In [51]:
df['Gender'].value_counts()

1    405380
0    132197
Name: Gender, dtype: int64

In [52]:
df['Age'].value_counts()

2    214690
3    107499
1     97634
4     44526
5     37618
6     20903
0     14707
Name: Age, dtype: int64

In [53]:
df.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Purchase                      0
dtype: int64